ЕРПУХАстенд.cbr_Основной/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="050b09a5-e36c-42b6-b337-cdddd2968bea">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.cbr_ТоварыКПеремещению</registerRecords>
  <tabularSections extendedConfigurationObject="ec1f4519-6787-456f-8137-6e0249afc4c8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>cbr_ЗаказПоставщику</name>
      <comment>//++АшаеваАН 13.02.26 СКЛ.3</comment>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>cbr_ПТУ</name>
      <comment>//++АшаеваАН 13.02.26 СКЛ.3</comment>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Module.bsl
#Область СлужебныеПроцедурыИФункции
&После("СкладОтправительПриИзменении")
&НаКлиенте
Процедура cbr_СкладОтправительПриИзменении(Элемент)
	
	//++АшаеваАН 13.02.26 СКЛ.3
	Если ЗначениеЗаполнено(Объект.СкладОтправитель) 
		 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "cbr_СкладРаспределения") Тогда
			ЭтаФорма.cbr_СкладРаспределения = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.СкладОтправитель, "cbr_СкладРаспределения");
	КонецЕсли;
	//--АшаеваАН 13.02.26 СКЛ.3
	
КонецПроцедуры

&ИзменениеИКонтроль("ОтвязатьОтЗаказаСервер")
&НаСервере
Процедура cbr_ОтвязатьОтЗаказаСервер(КэшированныеЗначения, ВсеСтроки)

	Если ВсеСтроки Тогда
		КоллекцияСтрок = Объект.Товары;
	Иначе
		КоллекцияСтрок = Элементы.Товары.ВыделенныеСтроки;
	КонецЕсли;

	Для Каждого ИдентификаторСтроки Из КоллекцияСтрок Цикл

		Если ВсеСтроки Тогда
			СтрокаТаблицы = ИдентификаторСтроки;
			ИдентификаторСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
		Иначе
			СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		КонецЕсли;

		НоменклатураКлиентСервер.ОбновитьКешированныеЗначенияДляУчетаСерий(СтрокаТаблицы, КэшированныеЗначения, ПараметрыУказанияСерий);

		СтрокаТаблицы.КодСтроки = 0;
		СтрокаТаблицы.РасхождениеЗаказ = 1;
		СтрокаТаблицы.Сделка = Справочники.СделкиСКлиентами.ПустаяСсылка();
		СтрокаТаблицы.НазначениеОтправителя = СтрокаТаблицы.Назначение;
		СтрокаТаблицы.ЗаказНаПеремещение = ЗаказВСтрокеСверхЗаказа(Объект.ПеремещениеПоЗаказам, Объект.ЗаказНаПеремещение);
		#Вставка
		//++АшаеваАН 13.02.26 СКЛ.3
		СтрокаТаблицы.cbr_ЗаказПоставщику = Неопределено;
		СтрокаТаблицы.cbr_ПТУ = Неопределено;
		//--АшаеваАН 13.02.26 СКЛ.3
		#КонецВставки

		// Переподчиним строки серий
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(Объект,ПараметрыУказанияСерий,ИдентификаторСтроки, КэшированныеЗначения);

	КонецЦикла;

	ОбновитьЗависимыеРеквизитыФормыСерверПоЗаказу();

КонецПроцедуры
#КонецОбласти
